using System.Collections.Generic;
using _0_Framework.Infrastructure;

namespace AccountManagement.Application.Contracts.Role
{
    public class EditRole : CreateRole
    {
        public long Id { get; set; }
        public List<PermissionDto> MappedPermissions { get; set; }

        public EditRole()
        {
            Permissions = new List<int>();
        }//----->وقتی که این کانتسراکتور رو کامنت میکریدیم برنامه درست کار میکرد یعنی مقدار پراپرتی پرمیشنز نال میشد
         // و توی سلکت لیست پرمیشن های قبلا داده شده به یک رول برای ما میومد و مشکلی نبود ولی وقتی
         // این کانستراکتور رو از کامنت در می آوردیم پراپرتی پرمیشنز مقدار میگرفت یعنی برابر با 
         // یک لیست خالی میشد و در سلکت لیست , ما دیگر پرمیشنز های یک رول را نمیدیدیم یعنی
         // عملیات بایندینگ انجام نمیشد . و ما برای رفع این مشکل آمدیم و
         // در رول ریپازیتوری  و در متد گت دیتیلز پراپرتی پرمیشنز را هم مقدار دهی کردیم که
         // برای فهمیدن تفاوت در این متد من کد های داخل این متد قبل از این تغییر را کامنت کردم
         //  تا با کد های جدید که در زیرشان قرار دارد بتوان مقایسه کرد 
         //  این توضیحاتی که دادم مربوط به ویدیوی 15 از فصل 20 میباشد یعنی فصل احراز هویت و حق دسترسی پارت دوم
    }
}